programming/java/code/tutorial/basic/java-8-basic-tutorial.org
#+title: The Java 8 Basic Tutorial
#+options: num:nil ^:nil creator:nil author:nil timestamp:nil

#+HTML_HEAD: <style type="text/css" >
#+HTML_HEAD_EXTRA: p { max-width: 70ch; }
#+HTML_HEAD_EXTRA: </style>

* Getting Started =getStarted= 5

An introduction to Java technology and lessons on installing Java
development software and using it to create a simple program.

#+BEGIN_EXAMPLE
  1) QandE/HelloWorldApp2.java
  2) QandE/Useless.java
  3) QandE/FirstClass.java
  4) QandE/SecondClass.java
  5) application/examples/HelloWorldApp.java
#+END_EXAMPLE

* Learning the Java Language =java= 167

Lessons describing the essential concepts and features of the Java
Programming Language.

** Object-Oriented Programming Concepts =concepts=

teaches you the core concepts behind object-oriented programming:
objects, messages, classes, and inheritance. This lesson ends by
showing you how these concepts translate into code. Feel free to skip
this lesson if you are already familiar with object-oriented
programming.

#+BEGIN_EXAMPLE
  - java/concepts/examples/BicycleDemo.java
  - java/concepts/examples/Bicycle.java
#+END_EXAMPLE

** Language Basics =nutsandbolts=

describes the traditional features of the language, including
variables, arrays, data types, operators, and control flow.

#+BEGIN_EXAMPLE
  - java/nutsandbolts/QandE/NestedIf.java
  - java/nutsandbolts/examples/ArithmeticDemo.java
  - java/nutsandbolts/examples/BitDemo.java
  - java/nutsandbolts/examples/ComparisonDemo.java
  - java/nutsandbolts/examples/ContinueDemo.java
  - java/nutsandbolts/examples/ForDemo.java
  - java/nutsandbolts/examples/MultiDimArrayDemo.java
  - java/nutsandbolts/examples/SwitchDemo2.java
  - java/nutsandbolts/examples/ArrayDemo.java
  - java/nutsandbolts/examples/BreakWithLabelDemo.java
  - java/nutsandbolts/examples/ConditionalDemo2.java
  - java/nutsandbolts/examples/EnhancedForDemo.java
  - java/nutsandbolts/examples/SwitchDemo.java
  - java/nutsandbolts/examples/WhileDemo.java
  - java/nutsandbolts/examples/ArrayCopyDemo.java
  - java/nutsandbolts/examples/BlockDemo.java
  - java/nutsandbolts/examples/ConcatDemo.java
  - java/nutsandbolts/examples/ContinueWithLabelDemo.java
  - java/nutsandbolts/examples/IfElseDemo.java
  - java/nutsandbolts/examples/PrePostDemo.java
  - java/nutsandbolts/examples/SwitchDemoFallThrough.java
  - java/nutsandbolts/examples/ArrayCopyOfDemo.java
  - java/nutsandbolts/examples/BreakDemo.java
  - java/nutsandbolts/examples/ConditionalDemo1.java
  - java/nutsandbolts/examples/DoWhileDemo.java
  - java/nutsandbolts/examples/InstanceofDemo.java
  - java/nutsandbolts/examples/StringSwitchDemo.java
  - java/nutsandbolts/examples/UnaryDemo.java
#+END_EXAMPLE

** Classes and Objects =javaOO=

describes how to write the classes from which objects are created, and
how to create and use the objects.

#+BEGIN_EXAMPLE
  - java/javaOO/QandE/IdentifyMyParts.java
  - java/javaOO/QandE/Point.java
  - java/javaOO/QandE/SomethingIsRight.java
  - java/javaOO/QandE/DataStructure.java
  - java/javaOO/QandE/NumberHolderDisplay.java
  - java/javaOO/QandE/Rectangle.java
  - java/javaOO/QandE/Class1.java
  - java/javaOO/QandE/Problem.java
  - java/javaOO/QandE/SomethingIsWrong.java
  - java/javaOO/QandE/Class2.java
  - java/javaOO/QandE/NumberHolder.java
  - java/javaOO/QandE/ProblemSolved.java
  - java/javaOO/examples/AClass.java
  - java/javaOO/examples/AlienCreatureTwo.java
  - java/javaOO/examples/Card2.java
  - java/javaOO/examples/Class1.java
  - java/javaOO/examples/Day.java
  - java/javaOO/examples/DisplayDeck.java
  - java/javaOO/examples/HelloWorldAnonymousClasses.java
  - java/javaOO/examples/MethodReferencesTest.java
  - java/javaOO/examples/Problem.java
  - java/javaOO/examples/RosterTest.java
  - java/javaOO/examples/StackOfInts.java
  - java/javaOO/examples/Suit.java
  - java/javaOO/examples/two/AlphaTwo.java
  - java/javaOO/examples/two/DeltaTwo.java
  - java/javaOO/examples/AlienCreatureOne.java
  - java/javaOO/examples/Card.java
  - java/javaOO/examples/Cats.java
  - java/javaOO/examples/DataStructure.java
  - java/javaOO/examples/Deck3.java
  - java/javaOO/examples/FillerTest.java
  - java/javaOO/examples/Point.java
  - java/javaOO/examples/Rectangle.java
  - java/javaOO/examples/Stack2.java
  - java/javaOO/examples/Subclass.java
  - java/javaOO/examples/one/DeltaOne.java
  - java/javaOO/examples/one/Alpha.java
  - java/javaOO/examples/AbstractClassTest.java
  - java/javaOO/examples/Animal.java
  - java/javaOO/examples/Card3.java
  - java/javaOO/examples/Class2.java
  - java/javaOO/examples/Deck.java
  - java/javaOO/examples/DisplayDeck2.java
  - java/javaOO/examples/LambdaScopeTest.java
  - java/javaOO/examples/Person.java
  - java/javaOO/examples/ProblemSolved.java
  - java/javaOO/examples/ShadowTest.java
  - java/javaOO/examples/StackTest.java
  - java/javaOO/examples/Superclass.java
  - java/javaOO/examples/AlienCreature.java
  - java/javaOO/examples/Calculator.java
  - java/javaOO/examples/Cat.java
  - java/javaOO/examples/CreateObjectDemo.java
  - java/javaOO/examples/Deck2.java
  - java/javaOO/examples/EnumTest.java
  - java/javaOO/examples/LocalClassExample.java
  - java/javaOO/examples/Planet.java
  - java/javaOO/examples/Rank.java
  - java/javaOO/examples/Stack.java
  - java/javaOO/examples/StackTest2.java
#+END_EXAMPLE

** Annotations =no-code=

are a form of metadata and provide information for the compiler. This
lesson describes where and how to use annotations in a program
effectively.

