programming/java/code/tutorial/basic/java-8-basic-tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Java 8 Basic Tutorial</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">The Java 8 Basic Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4f61a1e">Getting Started <code>getStarted</code> 5</a></li>
<li><a href="#orga798b89">Learning the Java Language <code>java</code> 167</a>
<ul>
<li><a href="#org3152153">Object-Oriented Programming Concepts <code>concepts</code></a></li>
<li><a href="#org51fc85f">Language Basics <code>nutsandbolts</code></a></li>
<li><a href="#org9dbabe1">Classes and Objects <code>javaOO</code></a></li>
<li><a href="#orgbae0d92">Annotations <code>no-code</code></a></li>
<li><a href="#orgfede26c">Interfaces and Inheritance <code>IandI</code></a></li>
<li><a href="#orga411ed5">Numbers and Strings <code>data</code></a></li>
<li><a href="#org1d0f941">Generics <code>generics</code></a></li>
<li><a href="#org3f5d921">Packages <code>package</code></a></li>
</ul>
</li>
<li><a href="#org91d184f">Essential Java Classes <code>essential</code> 87</a>
<ul>
<li><a href="#orga75b774">Exceptions <code>exceptions</code></a></li>
<li><a href="#org42eafaf">Basic I/O <code>io</code></a></li>
<li><a href="#org653ef4d">Concurrency <code>concurrency</code></a></li>
<li><a href="#orgabf6ee0">The Platform Environment <code>environment</code></a></li>
<li><a href="#orgc44474a">Regular Expressions <code>regex</code></a></li>
</ul>
</li>
<li><a href="#org41a6434">Collections <code>collections</code> 21</a>
<ul>
<li><a href="#org12e2909">Interfaces <code>interfaces</code></a></li>
<li><a href="#org4f58855">Aggregate Operations <code>streams</code></a></li>
<li><a href="#org995b7bd">Implementations <code>implementations</code></a></li>
<li><a href="#org332c5fc">Algorithms <code>algorithms</code></a>
<ul>
<li><a href="#org2437aa3"><code>Sort</code></a></li>
<li><a href="#org0a32822"><code>Anagrams2.java</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga4bfbf7">Date-Time APIs <code>datetime</code> 14</a>
<ul>
<li><a href="#org33b3775">date</a></li>
</ul>
</li>
<li><a href="#orgfd7450a">Deployment <code>deployment</code> 44</a></li>
<li><a href="#org479ec15">Preparation for Java Programming Language Certification <code>extra/certification</code> 0</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4f61a1e" class="outline-2">
<h2 id="org4f61a1e">Getting Started <code>getStarted</code> 5</h2>
<div class="outline-text-2" id="text-org4f61a1e">
<p>
An introduction to Java technology and lessons on installing Java
development software and using it to create a simple program.
</p>

<pre class="example">
1) QandE/HelloWorldApp2.java
2) QandE/Useless.java
3) QandE/FirstClass.java
4) QandE/SecondClass.java
5) application/examples/HelloWorldApp.java
</pre>
</div>
</div>

<div id="outline-container-orga798b89" class="outline-2">
<h2 id="orga798b89">Learning the Java Language <code>java</code> 167</h2>
<div class="outline-text-2" id="text-orga798b89">
<p>
Lessons describing the essential concepts and features of the Java
Programming Language.
</p>
</div>

<div id="outline-container-org3152153" class="outline-3">
<h3 id="org3152153">Object-Oriented Programming Concepts <code>concepts</code></h3>
<div class="outline-text-3" id="text-org3152153">
<p>
teaches you the core concepts behind object-oriented programming:
objects, messages, classes, and inheritance. This lesson ends by
showing you how these concepts translate into code. Feel free to skip
this lesson if you are already familiar with object-oriented
programming.
</p>

<pre class="example">
- java/concepts/examples/BicycleDemo.java
- java/concepts/examples/Bicycle.java
</pre>
</div>
</div>

<div id="outline-container-org51fc85f" class="outline-3">
<h3 id="org51fc85f">Language Basics <code>nutsandbolts</code></h3>
<div class="outline-text-3" id="text-org51fc85f">
<p>
describes the traditional features of the language, including
variables, arrays, data types, operators, and control flow.
</p>

<pre class="example">
- java/nutsandbolts/QandE/NestedIf.java
- java/nutsandbolts/examples/ArithmeticDemo.java
- java/nutsandbolts/examples/BitDemo.java
- java/nutsandbolts/examples/ComparisonDemo.java
- java/nutsandbolts/examples/ContinueDemo.java
- java/nutsandbolts/examples/ForDemo.java
- java/nutsandbolts/examples/MultiDimArrayDemo.java
- java/nutsandbolts/examples/SwitchDemo2.java
- java/nutsandbolts/examples/ArrayDemo.java
- java/nutsandbolts/examples/BreakWithLabelDemo.java
- java/nutsandbolts/examples/ConditionalDemo2.java
- java/nutsandbolts/examples/EnhancedForDemo.java
- java/nutsandbolts/examples/SwitchDemo.java
- java/nutsandbolts/examples/WhileDemo.java
- java/nutsandbolts/examples/ArrayCopyDemo.java
- java/nutsandbolts/examples/BlockDemo.java
- java/nutsandbolts/examples/ConcatDemo.java
- java/nutsandbolts/examples/ContinueWithLabelDemo.java
- java/nutsandbolts/examples/IfElseDemo.java
- java/nutsandbolts/examples/PrePostDemo.java
- java/nutsandbolts/examples/SwitchDemoFallThrough.java
- java/nutsandbolts/examples/ArrayCopyOfDemo.java
- java/nutsandbolts/examples/BreakDemo.java
- java/nutsandbolts/examples/ConditionalDemo1.java
- java/nutsandbolts/examples/DoWhileDemo.java
- java/nutsandbolts/examples/InstanceofDemo.java
- java/nutsandbolts/examples/StringSwitchDemo.java
- java/nutsandbolts/examples/UnaryDemo.java
</pre>
</div>
</div>

<div id="outline-container-org9dbabe1" class="outline-3">
<h3 id="org9dbabe1">Classes and Objects <code>javaOO</code></h3>
<div class="outline-text-3" id="text-org9dbabe1">
<p>
describes how to write the classes from which objects are created, and
how to create and use the objects.
</p>

<pre class="example">
- java/javaOO/QandE/IdentifyMyParts.java
- java/javaOO/QandE/Point.java
- java/javaOO/QandE/SomethingIsRight.java
- java/javaOO/QandE/DataStructure.java
- java/javaOO/QandE/NumberHolderDisplay.java
- java/javaOO/QandE/Rectangle.java
- java/javaOO/QandE/Class1.java
- java/javaOO/QandE/Problem.java
- java/javaOO/QandE/SomethingIsWrong.java
- java/javaOO/QandE/Class2.java
- java/javaOO/QandE/NumberHolder.java
- java/javaOO/QandE/ProblemSolved.java
- java/javaOO/examples/AClass.java
- java/javaOO/examples/AlienCreatureTwo.java
- java/javaOO/examples/Card2.java
- java/javaOO/examples/Class1.java
- java/javaOO/examples/Day.java
- java/javaOO/examples/DisplayDeck.java
- java/javaOO/examples/HelloWorldAnonymousClasses.java
- java/javaOO/examples/MethodReferencesTest.java
- java/javaOO/examples/Problem.java
- java/javaOO/examples/RosterTest.java
- java/javaOO/examples/StackOfInts.java
- java/javaOO/examples/Suit.java
- java/javaOO/examples/two/AlphaTwo.java
- java/javaOO/examples/two/DeltaTwo.java
- java/javaOO/examples/AlienCreatureOne.java
- java/javaOO/examples/Card.java
- java/javaOO/examples/Cats.java
- java/javaOO/examples/DataStructure.java
- java/javaOO/examples/Deck3.java
- java/javaOO/examples/FillerTest.java
- java/javaOO/examples/Point.java
- java/javaOO/examples/Rectangle.java
- java/javaOO/examples/Stack2.java
- java/javaOO/examples/Subclass.java
- java/javaOO/examples/one/DeltaOne.java
- java/javaOO/examples/one/Alpha.java
- java/javaOO/examples/AbstractClassTest.java
- java/javaOO/examples/Animal.java
- java/javaOO/examples/Card3.java
- java/javaOO/examples/Class2.java
- java/javaOO/examples/Deck.java
- java/javaOO/examples/DisplayDeck2.java
- java/javaOO/examples/LambdaScopeTest.java
- java/javaOO/examples/Person.java
- java/javaOO/examples/ProblemSolved.java
- java/javaOO/examples/ShadowTest.java
- java/javaOO/examples/StackTest.java
- java/javaOO/examples/Superclass.java
- java/javaOO/examples/AlienCreature.java
- java/javaOO/examples/Calculator.java
- java/javaOO/examples/Cat.java
- java/javaOO/examples/CreateObjectDemo.java
- java/javaOO/examples/Deck2.java
- java/javaOO/examples/EnumTest.java
- java/javaOO/examples/LocalClassExample.java
- java/javaOO/examples/Planet.java
- java/javaOO/examples/Rank.java
- java/javaOO/examples/Stack.java
- java/javaOO/examples/StackTest2.java
</pre>
</div>
</div>

<div id="outline-container-orgbae0d92" class="outline-3">
<h3 id="orgbae0d92">Annotations <code>no-code</code></h3>
<div class="outline-text-3" id="text-orgbae0d92">
<p>
are a form of metadata and provide information for the compiler. This
lesson describes where and how to use annotations in a program
effectively.
</p>
</div>
</div>
