programming/java/code/tutorial/basic/java-8-basic-tutorial.org
** Interfaces and Inheritance =IandI=

describes interfaces—what they are, why you would want to write one,
and how to write one. This section also describes the way in which you
can derive one class from another. That is, how a subclass can inherit
fields and methods from a superclass. You will learn that all classes
are derived from the Object class, and how to modify the methods that
a subclass inherits from superclasses.

#+BEGIN_EXAMPLE
  - java/IandI/examples/CharSequenceDemo.java
  - java/IandI/examples/MountainBike.java
  - java/IandI/examples/Relatable.java
  - java/IandI/examples/defaultmethods/Card.java
  - java/IandI/examples/defaultmethods/SortByRankThenSuit.java
  - java/IandI/examples/defaultmethods/TimeClient.java
  - java/IandI/examples/defaultmethods/SimpleTimeClient.java
  - java/IandI/examples/defaultmethods/TestSimpleTimeClient.java
  - java/IandI/examples/defaultmethods/Deck.java
  - java/IandI/examples/defaultmethods/SortFunction.java
  - java/IandI/examples/defaultmethods/PlayingCard.java
  - java/IandI/examples/defaultmethods/StandardDeck.java
  - java/IandI/examples/Card2.java
  - java/IandI/examples/RectanglePlus.java
  - java/IandI/examples/TimeClient.java
  - java/IandI/examples/Bicycle.java
  - java/IandI/examples/Deck.java
  - java/IandI/examples/Point.java
  - java/IandI/examples/RoadBike.java
  - java/IandI/examples/Card.java
  - java/IandI/examples/DisplayDeck.java
  - java/IandI/examples/Rectangle.java
  - java/IandI/examples/TestBikes.java
#+END_EXAMPLE

** Numbers and Strings =data=

This lesson describes how to use Number and String objects The lesson
also shows you how to format data for output.

#+BEGIN_EXAMPLE
  - java/data/QandE/Adder.java
  - java/data/QandE/FPAdder.java
  - java/data/QandE/ThisHappens.java
  - java/data/QandE/ComputeResult.java
  - java/data/QandE/MinVariablesDemo.java
  - java/data/QandE/Anagram.java
  - java/data/QandE/WhatHappens.java
  - java/data/QandE/ComputeInitials.java
  - java/data/QandE/MaxVariablesDemo.java
  - java/data/examples/ArrayOfArraysDemo.java
  - java/data/examples/BostonAccentDemo.java
  - java/data/examples/Filename.java
  - java/data/examples/MinDemo.java
  - java/data/examples/Rectangle.java
  - java/data/examples/SimplePoint.java
  - java/data/examples/StringsDemo.java
  - java/data/examples/Unboxing.java
  - java/data/examples/ArrayDemo.java
  - java/data/examples/BasicMathDemo.java
  - java/data/examples/ExponentialDemo.java
  - java/data/examples/Point.java
  - java/data/examples/ReverseStringTest.java
  - java/data/examples/StringDemo.java
  - java/data/examples/TrigonometricDemo.java
  - java/data/examples/Anagram.java
  - java/data/examples/ArrayOfArraysDemo2.java
  - java/data/examples/CharacterDemo.java
  - java/data/examples/FilenameDemo.java
  - java/data/examples/NumberDemo.java
  - java/data/examples/RegionMatchesDemo.java
  - java/data/examples/SimpleRectangle.java
  - java/data/examples/TestFormat.java
  - java/data/examples/ValueOfDemo.java
  - java/data/examples/ArrayCopyDemo.java
  - java/data/examples/ArrayOfStringsDemo.java
  - java/data/examples/DecimalFormatDemo.java
  - java/data/examples/InsertDemo.java
  - java/data/examples/Palindrome.java
  - java/data/examples/ReverseString.java
  - java/data/examples/StringBuilderDemo.java
  - java/data/examples/ToStringDemo.java
#+END_EXAMPLE

** Generics =generics=

are a powerful feature of the Java programming language. They improve
the type safety of your code, making more of your bugs detectable at
compile time.

#+BEGIN_EXAMPLE
  - java/generics/examples/CountVowels.java
  - java/generics/examples/WildcardErrorBad.java
  - java/generics/examples/BoxDemo.java
  - java/generics/examples/WildcardError.java
  - java/generics/examples/WildcardFixed.java
  - java/generics/examples/Box.java
  - java/generics/examples/MultiplicationTable.java
#+END_EXAMPLE

** Packages =package=

are a feature of the Java programming language that help you to
organize and structure your classes and their relationships to one
another.

#+BEGIN_EXAMPLE
  - java/package/QandE/question/Server.java
  - java/package/QandE/question/Client.java
  - java/package/QandE/question/Utilities.java
  - java/package/QandE/TimeClient.java
  - java/package/QandE/CharSequenceDemo.java
#+END_EXAMPLE

* Essential Java Classes =essential= 87

Lessons on exceptions, basic input/output, concurrency, regular
expressions, and the platform environment.

** Exceptions =exceptions=

explains the exception mechanism and how it is used to handle errors
and other exceptional conditions. This lesson describes what an
exception is, how to throw and catch exceptions, what to do with an
exception once it has been caught, and how to use the exception class
hierarchy.

#+BEGIN_EXAMPLE
  - exceptions/examples/InputFileDeclared.java
  - exceptions/examples/ListOfNumbersDeclared.java
  - exceptions/examples/InputFile.java
  - exceptions/examples/ListOfNumbers2.java
  - exceptions/examples/InputFileTest.java
  - exceptions/examples/ListOfNumbersTest.java
  - exceptions/examples/Cat.java
  - exceptions/examples/ListOfNumbers.java
#+END_EXAMPLE

** Basic I/O =io=

covers the Java platform classes used for basic input and output. It
focuses primarily on I/O Streams, a powerful concept that greatly
simplifies I/O operations. The lesson also looks at Serialization,
which lets a program write whole objects out to streams and read them
back again. Then the lesson looks at some file system operations,
including random access files. Finally, it touchs briefly on the
advanced features of the New I/O API.

#+BEGIN_EXAMPLE
  - io/QandE/CountLetter.java
  - io/QandE/FindInt.java
  - io/examples/Adler32.java
  - io/examples/CardWriter.java
  - io/examples/CheckedDataOutput.java
  - io/examples/CheckedOutputStream.java
  - io/examples/Chmod.java
  - io/examples/CopyLines.java
  - io/examples/FileType.java
  - io/examples/PrintfStuff.java
  - io/examples/Root2.java
  - io/examples/Standard.java
  - io/examples/CardReader.java
  - io/examples/CheckedDataInput.java
  - io/examples/CheckedInputStream.java
  - io/examples/Checksum.java
  - io/examples/CopyCharacters.java
  - io/examples/Email.java
  - io/examples/ListOfFiles.java
  - io/examples/PrintStuff.java
  - io/examples/Root.java
  - io/examples/SortThread.java
  - io/examples/BufferedCopy.java
  - io/examples/CheckedDIDemo.java
  - io/examples/CheckedIODemo.java
  - io/examples/CheckedRAFDemo.java
  - io/examples/Copy.java
  - io/examples/DataStreams.java
  - io/examples/Find.java
  - io/examples/ObjectStreams.java
  - io/examples/ReverseThread.java
  - io/examples/ScanSum.java
  - io/examples/WatchDir.java
  - io/examples/Card3.java
  - io/examples/CheckedDITest.java
  - io/examples/CheckedIOTest.java
  - io/examples/CheckedRAFTest.java
  - io/examples/CopyBytes.java
  - io/examples/DiskUsage.java
  - io/examples/Format.java
  - io/examples/Password.java
  - io/examples/RhymingWords.java
  - io/examples/ScanXan.java
  - io/examples/Xdd.java
#+END_EXAMPLE

