programming/java/code/tutorial/basic/java-8-basic-tutorial.org
** Concurrency =concurrency=

explains how to write applications that perform multiple tasks
simultaneously. The Java platform is designed from the ground up to
support concurrent programming, with basic concurrency support in the
Java programming language and the Java class libraries. Since version
5.0, the Java platform has also included high-level concurrency
APIs. This lesson introduces the platform's basic concurrency support
and summarizes some of the high-level APIs in the java.util.concurrent
packages.

#+BEGIN_EXAMPLE
  - concurrency/QandE/Consumer.java
  - concurrency/QandE/Producer.java
  - concurrency/QandE/BadThreads.java
  - concurrency/QandE/ProducerConsumerExample.java
  - concurrency/examples/Deadlock.java
  - concurrency/examples/HelloThread.java
  - concurrency/examples/ProducerConsumerExample.java
  - concurrency/examples/SynchronizedCounter.java
  - concurrency/examples/Counter.java
  - concurrency/examples/HelloRunnable.java
  - concurrency/examples/Producer.java
  - concurrency/examples/SleepMessages.java
  - concurrency/examples/AtomicCounter.java
  - concurrency/examples/Drop.java
  - concurrency/examples/ImmutableRGB.java
  - concurrency/examples/Safelock.java
  - concurrency/examples/SynchronizedRGB.java
  - concurrency/examples/Consumer.java
  - concurrency/examples/ForkBlur.java
  - concurrency/examples/SimpleThreads.java
#+END_EXAMPLE

** The Platform Environment =environment=

is defined by the underlying operating system, the Java virtual
machine, the class libraries, and various configuration data supplied
when the application is launched. This lesson describes some of the
APIs an application uses to examine and configure its platform
environment.

#+BEGIN_EXAMPLE
  - environment/QandE/PersistentEcho.java
  - environment/examples/Echo.java
  - environment/examples/PassEnv.java
  - environment/examples/Env.java
  - environment/examples/PropertiesTest.java
  - environment/examples/EnvMap.java
#+END_EXAMPLE

** Regular Expressions =regex=

are a way to describe a set of strings based on common characteristics
shared by each string in the set. They can be used to search, edit, or
manipulate text and data. Regular expressions vary in complexity, but
once you understand the basics of how they're constructed, you'll be
able to decipher (or create) any regular expression. This lesson
teaches the regular expression syntax supported by the java.util.regex
API, and presents several working examples to illustrate how the
various objects interact.

#+BEGIN_EXAMPLE
  - regex/examples/RegexDemo.java
  - regex/examples/ReplaceDemo2.java
  - regex/examples/MatchesLooking.java
  - regex/examples/ReplaceDemo.java
  - regex/examples/RegexTestHarness.java
  - regex/examples/SplitDemo.java
  - regex/examples/MatcherDemo.java
  - regex/examples/RegexTestHarness2.java
  - regex/examples/SplitDemo2.java
#+END_EXAMPLE

* Collections =collections= 21

Lessons on using and extending the Java Collections Framework.

Introduction tells you what collections are, and how they'll make your
job easier and your programs better. You'll learn about the core
elements that comprise the Collections Framework: interfaces,
implementations and algorithms.

** Interfaces =interfaces=

Interfaces describes the core collection interfaces, which are the
heart and soul of the Java Collections Framework. You'll learn general
guidelines for effective use of these interfaces, including when to
use which interface. You'll also learn idioms for each interface that
will help you get the most out of the interfaces.

#+BEGIN_EXAMPLE
  - interfaces/QandE/ListTrim.java
  - interfaces/QandE/Ran.java
  - interfaces/QandE/FindDups.java
  - interfaces/examples/Deal.java
  - interfaces/examples/Shuffle.java
  - interfaces/examples/ArrayDequeSample.java
  - interfaces/examples/Freq.java
  - interfaces/examples/OysterMonths.java
  - interfaces/examples/FindDups.java
  - interfaces/examples/Name.java
  - interfaces/examples/Anagrams.java
  - interfaces/examples/FindDups2.java
  - interfaces/examples/NameSort.java
#+END_EXAMPLE

** Aggregate Operations =streams=

iterate over collections on your behalf, which enable you to write
more concise and efficient code that process elements stored in
collections.

#+BEGIN_EXAMPLE
  - streams/examples/Averager.java
  - streams/examples/Person.java
  - streams/examples/ParallelismExamples.java
  - streams/examples/BulkDataOperationsExamples.java
  - streams/examples/ReductionExamples.java
#+END_EXAMPLE


- algorithms
- custom-implementations
- implementations
  - FileList.java
- interfaces
  - Anagrams.java
  - ArrayDequeSample.java
  - Deal.java
  - dictionary.txt
  - FindDups2.java
  - FindDups.java
  - Freq.java
  - Name.java
  - NameSort.java
  - OysterMonths.java
  - Shuffle.java
  - FindDups.java
  - ListTrim.java
  - Ran.java
- interoperability
- intro
- streams
  - Averager.java
  - BulkDataOperationsExamples.java
  - ParallelismExamples.java
  - Person.java
  - ReductionExamples.java

** Implementations =implementations=

describes the JDK's general-purpose collection implementations and
tells you when to use which implementation. You'll also learn about
the wrapper implementations, which add functionality to
general-purpose implementations.

#+BEGIN_EXAMPLE
  - implementations/QandE/FileList.java
#+END_EXAMPLE

** Algorithms =algorithms=

Algorithms describes the polymorphic algorithms provided by the JDK to
operate on collections. With any luck you'll never have to write your
own sort routine again!

#+BEGIN_EXAMPLE
  - algorithms/examples/Anagrams2.java
  - algorithms/examples/Sort.java
#+END_EXAMPLE

*** =Sort=

#+BEGIN_EXAMPLE
$ javac -Xlint Sort.java 
$ java Sort i walk the line
  [i, line, the, walk]
#+END_EXAMPLE

**** =Sort.java=

#+BEGIN_SRC java -n :angle Sort.java :padline no
  import java.util.Arrays;
  import java.util.Collections;
  import java.util.List;

  public class Sort {
    public static void main(String[] args) {
      List<String> list = Arrays.asList(args);
      Collections.sort(list);
      System.out.println(list);
    }
  }
#+END_SRC

