programming/java/code/tutorial/basic/java-8-basic-tutorial.html

<div id="outline-container-org653ef4d" class="outline-3">
<h3 id="org653ef4d">Concurrency <code>concurrency</code></h3>
<div class="outline-text-3" id="text-org653ef4d">
<p>
explains how to write applications that perform multiple tasks
simultaneously. The Java platform is designed from the ground up to
support concurrent programming, with basic concurrency support in the
Java programming language and the Java class libraries. Since version
5.0, the Java platform has also included high-level concurrency
APIs. This lesson introduces the platform's basic concurrency support
and summarizes some of the high-level APIs in the java.util.concurrent
packages.
</p>

<pre class="example">
- concurrency/QandE/Consumer.java
- concurrency/QandE/Producer.java
- concurrency/QandE/BadThreads.java
- concurrency/QandE/ProducerConsumerExample.java
- concurrency/examples/Deadlock.java
- concurrency/examples/HelloThread.java
- concurrency/examples/ProducerConsumerExample.java
- concurrency/examples/SynchronizedCounter.java
- concurrency/examples/Counter.java
- concurrency/examples/HelloRunnable.java
- concurrency/examples/Producer.java
- concurrency/examples/SleepMessages.java
- concurrency/examples/AtomicCounter.java
- concurrency/examples/Drop.java
- concurrency/examples/ImmutableRGB.java
- concurrency/examples/Safelock.java
- concurrency/examples/SynchronizedRGB.java
- concurrency/examples/Consumer.java
- concurrency/examples/ForkBlur.java
- concurrency/examples/SimpleThreads.java
</pre>
</div>
</div>

<div id="outline-container-orgabf6ee0" class="outline-3">
<h3 id="orgabf6ee0">The Platform Environment <code>environment</code></h3>
<div class="outline-text-3" id="text-orgabf6ee0">
<p>
is defined by the underlying operating system, the Java virtual
machine, the class libraries, and various configuration data supplied
when the application is launched. This lesson describes some of the
APIs an application uses to examine and configure its platform
environment.
</p>

<pre class="example">
- environment/QandE/PersistentEcho.java
- environment/examples/Echo.java
- environment/examples/PassEnv.java
- environment/examples/Env.java
- environment/examples/PropertiesTest.java
- environment/examples/EnvMap.java
</pre>
</div>
</div>

<div id="outline-container-orgc44474a" class="outline-3">
<h3 id="orgc44474a">Regular Expressions <code>regex</code></h3>
<div class="outline-text-3" id="text-orgc44474a">
<p>
are a way to describe a set of strings based on common characteristics
shared by each string in the set. They can be used to search, edit, or
manipulate text and data. Regular expressions vary in complexity, but
once you understand the basics of how they're constructed, you'll be
able to decipher (or create) any regular expression. This lesson
teaches the regular expression syntax supported by the java.util.regex
API, and presents several working examples to illustrate how the
various objects interact.
</p>

<pre class="example">
- regex/examples/RegexDemo.java
- regex/examples/ReplaceDemo2.java
- regex/examples/MatchesLooking.java
- regex/examples/ReplaceDemo.java
- regex/examples/RegexTestHarness.java
- regex/examples/SplitDemo.java
- regex/examples/MatcherDemo.java
- regex/examples/RegexTestHarness2.java
- regex/examples/SplitDemo2.java
</pre>
</div>
</div>
</div>

<div id="outline-container-org41a6434" class="outline-2">
<h2 id="org41a6434">Collections <code>collections</code> 21</h2>
<div class="outline-text-2" id="text-org41a6434">
<p>
Lessons on using and extending the Java Collections Framework.
</p>

<p>
Introduction tells you what collections are, and how they'll make your
job easier and your programs better. You'll learn about the core
elements that comprise the Collections Framework: interfaces,
implementations and algorithms.
</p>
</div>

<div id="outline-container-org12e2909" class="outline-3">
<h3 id="org12e2909">Interfaces <code>interfaces</code></h3>
<div class="outline-text-3" id="text-org12e2909">
<p>
Interfaces describes the core collection interfaces, which are the
heart and soul of the Java Collections Framework. You'll learn general
guidelines for effective use of these interfaces, including when to
use which interface. You'll also learn idioms for each interface that
will help you get the most out of the interfaces.
</p>

<pre class="example">
- interfaces/QandE/ListTrim.java
- interfaces/QandE/Ran.java
- interfaces/QandE/FindDups.java
- interfaces/examples/Deal.java
- interfaces/examples/Shuffle.java
- interfaces/examples/ArrayDequeSample.java
- interfaces/examples/Freq.java
- interfaces/examples/OysterMonths.java
- interfaces/examples/FindDups.java
- interfaces/examples/Name.java
- interfaces/examples/Anagrams.java
- interfaces/examples/FindDups2.java
- interfaces/examples/NameSort.java
</pre>
</div>
</div>

<div id="outline-container-org4f58855" class="outline-3">
<h3 id="org4f58855">Aggregate Operations <code>streams</code></h3>
<div class="outline-text-3" id="text-org4f58855">
<p>
iterate over collections on your behalf, which enable you to write
more concise and efficient code that process elements stored in
collections.
</p>

<pre class="example">
- streams/examples/Averager.java
- streams/examples/Person.java
- streams/examples/ParallelismExamples.java
- streams/examples/BulkDataOperationsExamples.java
- streams/examples/ReductionExamples.java
</pre>


<ul class="org-ul">
<li>algorithms</li>
<li>custom-implementations</li>
<li>implementations
<ul class="org-ul">
<li>FileList.java</li>
</ul></li>
<li>interfaces
<ul class="org-ul">
<li>Anagrams.java</li>
<li>ArrayDequeSample.java</li>
<li>Deal.java</li>
<li>dictionary.txt</li>
<li>FindDups2.java</li>
<li>FindDups.java</li>
<li>Freq.java</li>
<li>Name.java</li>
<li>NameSort.java</li>
<li>OysterMonths.java</li>
<li>Shuffle.java</li>
<li>FindDups.java</li>
<li>ListTrim.java</li>
<li>Ran.java</li>
</ul></li>
<li>interoperability</li>
<li>intro</li>
<li>streams
<ul class="org-ul">
<li>Averager.java</li>
<li>BulkDataOperationsExamples.java</li>
<li>ParallelismExamples.java</li>
<li>Person.java</li>
<li>ReductionExamples.java</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org995b7bd" class="outline-3">
<h3 id="org995b7bd">Implementations <code>implementations</code></h3>
<div class="outline-text-3" id="text-org995b7bd">
<p>
describes the JDK's general-purpose collection implementations and
tells you when to use which implementation. You'll also learn about
the wrapper implementations, which add functionality to
general-purpose implementations.
</p>

<pre class="example">
- implementations/QandE/FileList.java
</pre>
</div>
</div>

<div id="outline-container-org332c5fc" class="outline-3">
<h3 id="org332c5fc">Algorithms <code>algorithms</code></h3>
<div class="outline-text-3" id="text-org332c5fc">
<p>
Algorithms describes the polymorphic algorithms provided by the JDK to
operate on collections. With any luck you'll never have to write your
own sort routine again!
</p>

<pre class="example">
- algorithms/examples/Anagrams2.java
- algorithms/examples/Sort.java
</pre>
</div>

<div id="outline-container-org2437aa3" class="outline-4">
<h4 id="org2437aa3"><code>Sort</code></h4>
<div class="outline-text-4" id="text-org2437aa3">
<pre class="example">
$ javac -Xlint Sort.java 
$ java Sort i walk the line
  [i, line, the, walk]
</pre>
</div>

<ul class="org-ul">
<li><a id="org1817021"></a><code>Sort.java</code><br />
<div class="outline-text-5" id="text-org1817021">
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Arrays</span>;
<span class="linenr"> 2: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Collections</span>;
<span class="linenr"> 3: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">List</span>;
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #8b0000;">public</span> <span style="color: #8b0000;">class</span> <span style="color: #4682b4;">Sort</span> {
<span class="linenr"> 6: </span>  <span style="color: #8b0000;">public</span> <span style="color: #8b0000;">static</span> <span style="color: #4682b4;">void</span> <span style="color: #8b2323;">main</span>(<span style="color: #4682b4;">String</span>[] <span style="color: #8b008b;">args</span>) {
<span class="linenr"> 7: </span>    <span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt; <span style="color: #8b008b;">list</span> = Arrays.asList(args);
<span class="linenr"> 8: </span>    Collections.sort(list);
<span class="linenr"> 9: </span>    System.out.println(list);
<span class="linenr">10: </span>  }
<span class="linenr">11: </span>}
</pre>
</div>
</div>
</li>
</ul>
</div>
