programming/java/code/tutorial/basic/java-8-basic-tutorial.org
*** =Anagrams2.java=

#+BEGIN_EXAMPLE
  $ javac -Xlint Anagrams2.java 
  $ java Anagrams2 dictionary.txt 8
#+END_EXAMPLE

#+BEGIN_SRC java -n :tangle Anagrams2.java :padline no
  import java.io.File;
  import java.io.IOException;
  import java.io.PrintStream;
  import java.util.ArrayList;
  import java.util.Arrays;
  import java.util.Collection;
  import java.util.Collections;
  import java.util.Comparator;
  import java.util.HashMap;
  import java.util.Iterator;
  import java.util.List;
  import java.util.Map;
  import java.util.Scanner;

  public class Anagrams2 {
  
    public static void main(String[] args) {
      int minGroupSize = Integer.parseInt(args[1]);

      // Read words from file and put into simulated multimap
      Map<String, List<String>> m
          = new HashMap<String, List<String>>();
      try {
        Scanner s = new Scanner(new File(args[0]));
        while (s.hasNext()) {
          String word = s.next();
          String alpha = alphabetize(word);
          List<String> l = m.get(alpha);
          if (l == null) {
            m.put(alpha, l = new ArrayList<String>());
          }
          l.add(word);
        }
      } catch (IOException e) {
        System.err.println(e);
        System.exit(1);
      }

      // Make a List of all permutation groups above size threshold
      List<List<String>> winners = new ArrayList<List<String>>();
      for (List<String> l : m.values()) {
        if (l.size() >= minGroupSize) {
          winners.add(l);
        }
      }

      // Sort permutation groups according to size
      Collections.sort(winners, new Comparator<List<String>>() {
          public int compare(List<String> o1, List<String> o2) {
            return o2.size() - o1.size();
          }
        });

      // Print permutation groups
      for (List<String> l : winners) {
        System.out.println(l.size() + ": " + l);
      }
    }

    private static String alphabetize(String s) {
      char[] a = s.toCharArray();
      Arrays.sort(a);
      return new String(a);
    }
  }
#+END_SRC

* Date-Time APIs =datetime= 14

How to use the java.time pages to write date and time code.

#+BEGIN_EXAMPLE
  1) iso/QandE/ListMondays.java
  2) iso/QandE/MonthsInYear.java
  3) iso/QandE/FridayThirteenQuery.java
  4) iso/QandE/Superstitious.java
  5) iso/examples/FamilyBirthdays.java
  6) iso/examples/NextPayday.java
  7) iso/examples/TimeZoneId.java
  8) iso/examples/CheckDate.java
  9) iso/examples/StringConverter.java
  10) iso/examples/FamilyVacations.java
  11) iso/examples/Parse.java
  12) iso/examples/Birthday.java
  13) iso/examples/Flight.java
  14) iso/examples/PaydayAdjuster.java
#+END_EXAMPLE

** date

- Birthday
- CheckDate
- Flight
- parse
- pay
- StringConverter
- TimeZoneId

