programming/java/code/tutorial/basic/java-8-basic-tutorial.html

<div id="outline-container-org0a32822" class="outline-4">
<h4 id="org0a32822"><code>Anagrams2.java</code></h4>
<div class="outline-text-4" id="text-org0a32822">
<pre class="example">
$ javac -Xlint Anagrams2.java 
$ java Anagrams2 dictionary.txt 8
</pre>

<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">io</span>.<span style="color: #4682b4;">File</span>;
<span class="linenr"> 2: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">io</span>.<span style="color: #4682b4;">IOException</span>;
<span class="linenr"> 3: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">io</span>.<span style="color: #4682b4;">PrintStream</span>;
<span class="linenr"> 4: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">ArrayList</span>;
<span class="linenr"> 5: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Arrays</span>;
<span class="linenr"> 6: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Collection</span>;
<span class="linenr"> 7: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Collections</span>;
<span class="linenr"> 8: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Comparator</span>;
<span class="linenr"> 9: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">HashMap</span>;
<span class="linenr">10: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Iterator</span>;
<span class="linenr">11: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">List</span>;
<span class="linenr">12: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Map</span>;
<span class="linenr">13: </span><span style="color: #8b0000;">import</span> <span style="color: #cd0000;">java</span>.<span style="color: #cd0000;">util</span>.<span style="color: #4682b4;">Scanner</span>;
<span class="linenr">14: </span>
<span class="linenr">15: </span><span style="color: #8b0000;">public</span> <span style="color: #8b0000;">class</span> <span style="color: #4682b4;">Anagrams2</span> {
<span class="linenr">16: </span>
<span class="linenr">17: </span>  <span style="color: #8b0000;">public</span> <span style="color: #8b0000;">static</span> <span style="color: #4682b4;">void</span> <span style="color: #8b2323;">main</span>(<span style="color: #4682b4;">String</span>[] <span style="color: #8b008b;">args</span>) {
<span class="linenr">18: </span>    <span style="color: #4682b4;">int</span> <span style="color: #8b008b;">minGroupSize</span> = Integer.parseInt(args[1]);
<span class="linenr">19: </span>
<span class="linenr">20: </span>    <span style="color: #00008b;">// </span><span style="color: #00008b;">Read words from file and put into simulated multimap</span>
<span class="linenr">21: </span>    <span style="color: #4682b4;">Map</span>&lt;<span style="color: #4682b4;">String</span>, <span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt;&gt; <span style="color: #8b008b;">m</span>
<span class="linenr">22: </span>        = <span style="color: #8b0000;">new</span> <span style="color: #4682b4;">HashMap</span>&lt;<span style="color: #4682b4;">String</span>, <span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt;&gt;();
<span class="linenr">23: </span>    <span style="color: #8b0000;">try</span> {
<span class="linenr">24: </span>      <span style="color: #4682b4;">Scanner</span> <span style="color: #8b008b;">s</span> = <span style="color: #8b0000;">new</span> <span style="color: #4682b4;">Scanner</span>(<span style="color: #8b0000;">new</span> <span style="color: #4682b4;">File</span>(args[0]));
<span class="linenr">25: </span>      <span style="color: #8b0000;">while</span> (s.hasNext()) {
<span class="linenr">26: </span>        <span style="color: #4682b4;">String</span> <span style="color: #8b008b;">word</span> = s.next();
<span class="linenr">27: </span>        <span style="color: #4682b4;">String</span> <span style="color: #8b008b;">alpha</span> = alphabetize(word);
<span class="linenr">28: </span>        <span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt; <span style="color: #8b008b;">l</span> = m.get(alpha);
<span class="linenr">29: </span>        <span style="color: #8b0000;">if</span> (l == <span style="color: #cd0000;">null</span>) {
<span class="linenr">30: </span>          m.put(alpha, l = <span style="color: #8b0000;">new</span> <span style="color: #4682b4;">ArrayList</span>&lt;<span style="color: #4682b4;">String</span>&gt;());
<span class="linenr">31: </span>        }
<span class="linenr">32: </span>        l.add(word);
<span class="linenr">33: </span>      }
<span class="linenr">34: </span>    } <span style="color: #8b0000;">catch</span> (<span style="color: #4682b4;">IOException</span> <span style="color: #8b008b;">e</span>) {
<span class="linenr">35: </span>      System.err.println(e);
<span class="linenr">36: </span>      System.exit(1);
<span class="linenr">37: </span>    }
<span class="linenr">38: </span>
<span class="linenr">39: </span>    <span style="color: #00008b;">// </span><span style="color: #00008b;">Make a List of all permutation groups above size threshold</span>
<span class="linenr">40: </span>    <span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt;&gt; <span style="color: #8b008b;">winners</span> = <span style="color: #8b0000;">new</span> <span style="color: #4682b4;">ArrayList</span>&lt;<span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt;&gt;();
<span class="linenr">41: </span>    <span style="color: #8b0000;">for</span> (<span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt; <span style="color: #8b2323;">l</span> : m.values()) {
<span class="linenr">42: </span>      <span style="color: #8b0000;">if</span> (l.size() &gt;= minGroupSize) {
<span class="linenr">43: </span>        winners.add(l);
<span class="linenr">44: </span>      }
<span class="linenr">45: </span>    }
<span class="linenr">46: </span>
<span class="linenr">47: </span>    <span style="color: #00008b;">// </span><span style="color: #00008b;">Sort permutation groups according to size</span>
<span class="linenr">48: </span>    Collections.sort(winners, <span style="color: #8b0000;">new</span> <span style="color: #4682b4;">Comparator</span>&lt;<span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt;&gt;() {
<span class="linenr">49: </span>        <span style="color: #8b0000;">public</span> <span style="color: #4682b4;">int</span> <span style="color: #8b2323;">compare</span>(<span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt; <span style="color: #8b008b;">o1</span>, <span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt; <span style="color: #8b008b;">o2</span>) {
<span class="linenr">50: </span>          <span style="color: #8b0000;">return</span> o2.size() - o1.size();
<span class="linenr">51: </span>        }
<span class="linenr">52: </span>      });
<span class="linenr">53: </span>
<span class="linenr">54: </span>    <span style="color: #00008b;">// </span><span style="color: #00008b;">Print permutation groups</span>
<span class="linenr">55: </span>    <span style="color: #8b0000;">for</span> (<span style="color: #4682b4;">List</span>&lt;<span style="color: #4682b4;">String</span>&gt; <span style="color: #8b008b;">l</span> : winners) {
<span class="linenr">56: </span>      System.out.println(l.size() + <span style="color: #008b00;">": "</span> + l);
<span class="linenr">57: </span>    }
<span class="linenr">58: </span>  }
<span class="linenr">59: </span>
<span class="linenr">60: </span>  <span style="color: #8b0000;">private</span> <span style="color: #8b0000;">static</span> <span style="color: #4682b4;">String</span> <span style="color: #8b2323;">alphabetize</span>(<span style="color: #4682b4;">String</span> <span style="color: #8b008b;">s</span>) {
<span class="linenr">61: </span>    <span style="color: #4682b4;">char</span>[] <span style="color: #8b008b;">a</span> = s.toCharArray();
<span class="linenr">62: </span>    Arrays.sort(a);
<span class="linenr">63: </span>    <span style="color: #8b0000;">return</span> <span style="color: #8b0000;">new</span> <span style="color: #4682b4;">String</span>(a);
<span class="linenr">64: </span>  }
<span class="linenr">65: </span>}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orga4bfbf7" class="outline-2">
<h2 id="orga4bfbf7">Date-Time APIs <code>datetime</code> 14</h2>
<div class="outline-text-2" id="text-orga4bfbf7">
<p>
How to use the java.time pages to write date and time code.
</p>

<pre class="example">
1) iso/QandE/ListMondays.java
2) iso/QandE/MonthsInYear.java
3) iso/QandE/FridayThirteenQuery.java
4) iso/QandE/Superstitious.java
5) iso/examples/FamilyBirthdays.java
6) iso/examples/NextPayday.java
7) iso/examples/TimeZoneId.java
8) iso/examples/CheckDate.java
9) iso/examples/StringConverter.java
10) iso/examples/FamilyVacations.java
11) iso/examples/Parse.java
12) iso/examples/Birthday.java
13) iso/examples/Flight.java
14) iso/examples/PaydayAdjuster.java
</pre>
</div>
