programming/java/code/tutorial/basic/java-8-basic-tutorial.org
* Deployment =deployment= 44

How to package applications and applets using JAR files, and deploy
them using Java Web Start and Java Plug-in.

#+BEGIN_EXAMPLE
  1) applet/examples/QuoteServerThread.java
  2) applet/examples/applet_AppletWithParameters/src/AppletTakesParams.java
  3) applet/examples/applet_ComponentArch_DynamicTreeDemo/src/appletComponentArch/DynamicTree.java
  4) applet/examples/applet_ComponentArch_DynamicTreeDemo/src/appletComponentArch/DynamicTreeApplet.java
  5) applet/examples/applet_ComponentArch_DynamicTreeDemo/src/appletComponentArch/DynamicTreePanel.java
  6) applet/examples/applet_Draggable/src/MenuItemChooser.java
  7) applet/examples/applet_Draggable/src/MenuItem.java
  8) applet/examples/applet_Draggable/src/MenuChooserApplet.java
  9) applet/examples/applet_GetApplets/src/GetApplets.java
  10) applet/examples/applet_HelloWorld/src/HelloWorld.java
  11) applet/examples/applet_InvokingAppletMethodsFromJavaScript/src/jstojava/MathApplet.java
  12) applet/examples/applet_InvokingAppletMethodsFromJavaScript/src/jstojava/DateHelper.java
  13) applet/examples/applet_InvokingAppletMethodsFromJavaScript/src/jstojava/Calculator.java
  14) applet/examples/applet_InvokingJavaScriptFromApplet/src/javatojs/DataSummaryApplet.java
  15) applet/examples/applet_InvokingJavaScriptFromApplet/src/javatojs/DomUtil.java
  16) applet/examples/applet_SenderReceiver/src/Receiver.java
  17) applet/examples/applet_SenderReceiver/src/Sender.java
  18) applet/examples/applet_ShowDocument/src/ShowDocument.java
  19) applet/examples/applet_Simple/src/Simple.java
  20) applet/examples/applet_StatusAndCallback/src/DrawingApplet.java
  21) applet/examples/applet_TraversingDOM/src/DOMDump.java
  22) applet/examples/QuoteServer.java
  23) applet/examples/QuoteClientApplet.java
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  1. doingMoreWithRIA/examples/applet_AccessingCookies/src/CookieAccessor.java
  2. doingMoreWithRIA/examples/applet_AccessingCookies/src/CookieApplet.java
  3. doingMoreWithRIA/examples/applet_JNLP_API/src/TextEditor.java
  4. doingMoreWithRIA/examples/applet_JNLP_API/src/FileHandler.java
  5. doingMoreWithRIA/examples/applet_JNLP_API/src/TextEditorApplet.java
  6. doingMoreWithRIA/examples/applet_PropertiesAndVMArgs/src/PropertiesArgsDemoApplet.java
  7. jar/examples/JarRunner.java
  8. jar/examples/JarClassLoader.java
  9. selfContainedApps/examples/packager_DynamicTreeDemo/src/webstartComponentArch/DynamicTreePanel.java
  10. selfContainedApps/examples/packager_DynamicTreeDemo/src/webstartComponentArch/DynamicTree.java
  11. selfContainedApps/examples/packager_DynamicTreeDemo/src/webstartComponentArch/DynamicTreeApplication.java
  12. selfContainedApps/examples/packager_FileAssociations/src/sample/fa/ScriptRunnerApplicationMac.java
  13. selfContainedApps/examples/packager_FileAssociations/src/sample/fa/ScriptRunnerApplication.java
  14. selfContainedApps/examples/packager_MultipleLaunchers/src/webstartComponentArch/DynamicTree.java
  15. selfContainedApps/examples/packager_MultipleLaunchers/src/webstartComponentArch/DynamicTreeApplication.java
  16. selfContainedApps/examples/packager_MultipleLaunchers/src/webstartComponentArch/DynamicTreePanel.java
  17. selfContainedApps/examples/packager_MultipleLaunchers/src/sample/fa/ScriptRunnerApplicationMac.java
  18. selfContainedApps/examples/packager_MultipleLaunchers/src/sample/fa/ScriptRunnerApplication.java
  19. webstart/examples/webstart_ComponentArch_DynamicTreeDemo/src/webstartComponentArch/DynamicTree.java
  20. webstart/examples/webstart_ComponentArch_DynamicTreeDemo/src/webstartComponentArch/DynamicTreeApplication.java
  21. webstart/examples/webstart_ComponentArch_DynamicTreeDemo/src/webstartComponentArch/DynamicTreePanel.java
#+END_EXAMPLE
  
* Preparation for Java Programming Language Certification =extra/certification= 0

List of available training and tutorial resources.
